# CapstoneData Wrangling


Data wrangling is the second step in the Data Science Method. This step consists of multiple components including Data Collection, Data Organization, Data Definitions, and Data Cleaning.



**The Data Science Method**  


1.   Problem Identification 

2.   **Data Wrangling** 
  * Data Collection
      - Locating the data
      - Data loading
      - Data joining
   * Data Organization
      -  File structure
      -  Git & Github
  * Data Definition
      - Column names
      - Data types (numeric, categorical, timestamp, etc.)
      - Description of the columns
      - Count or percent per unique values or codes (including NA)
      - The range of values or codes  
  * Data Cleaning
      - NA or missing data
      - Duplicates
 
3.   Exploratory Data Analysis 

4.   Pre-processing and Training Data Development

5.   Modeling 

6.   Documentation

## Data Collection

First, you'll load the needed packages and modules into Python. Then you'll load the data into a pandas dataframe for ease of use. Run the cell below to get started.

#In this exercise we are going to cover 4 areas of Data Preparation
#1 - Data Load
#2 - Data Organsation
#3 - Data Definition
#4 - Data Cleaning

In [1]:
#load python packages
import os
import pandas as pd
import datetime
import seaborn as sns
import matplotlib.pyplot as plt
import numpy as np
%matplotlib inline

**<font color='teal'> Print the current working directory </font>**

In [2]:
os.getcwd()

'/Users/deepankarsingh/Data science/capstone project_demand_prediction/notebook'

### Load the data from the csv file
Data has been taken from kaggle .
Link for the data - https://www.kaggle.com/veeralakrishna/predict-demand?select=test.csv
File name as saved in the drive - `sales_data.csv`

<font color='teal'> **Load the data into a pandas dataframe and print the first five rows of the dataframe.**</font>

In [3]:
df = pd.read_csv("sales_data.csv" ,index_col= 'id' ,parse_dates = ['date'])
df.head()

,date,city,lat,long,pop,shop,brand,container,capacity,price,quantity
id,,,,,,,,,,,
0.0,2012-01-31,Athens,37.97945,23.71622,672130.0,shop_1,kinder-cola,glass,500ml,0.96,13280.0
1.0,2012-01-31,Athens,37.97945,23.71622,672130.0,shop_1,kinder-cola,plastic,1.5lt,2.86,6727.0
2.0,2012-01-31,Athens,37.97945,23.71622,672130.0,shop_1,kinder-cola,can,330ml,0.87,9848.0
3.0,2012-01-31,Athens,37.97945,23.71622,672130.0,shop_1,adult-cola,glass,500ml,1.00,20050.0
4.0,2012-01-31,Athens,37.97945,23.71622,672130.0,shop_1,adult-cola,can,330ml,0.39,25696.0

## Data Organization

Data organization for this guided capstone involves creating a basic project folder structure. As you read in the Medium article introducing the data wrangling step, this step is often completed using Github or a module such as cookiecutter. Now that you have your data and your notebook pointing to your working project directory, let's start by printing the current file location. You'll then create a few subfolders to keep your project organized.

<font color='teal'> **Finish the statement below by assigning the path variable.**</font>

In [4]:
path = '/Users/deepankarsingh/Data science/capstone project_demand_prediction'

In [5]:
print ("The current working directory is %s" % path)

The current working directory is /Users/deepankarsingh/Data science/capstone project_demand_prediction

### Create subfolders in your project directory

Now, create some subfolders inside your project folder.

<font color='teal'> **Create a folder for the data visualizations you will create in future steps called `figures`.**</font>

In [6]:
#os.mkdir('figures')

<font color='teal'> **Print the contents of your project folder to confirm you created the additional folders in your directory.**</font>

In [7]:
os.getcwd()

'/Users/deepankarsingh/Data science/capstone project_demand_prediction/notebook'

## Data Definition
In this step, you'll review column names, data types, and null values.

### Column Names 
<font color='teal'> **Print the columns names of the entire dataframe**</font>

In [8]:
df.columns

Index(['date', 'city', 'lat', 'long', 'pop', 'shop', 'brand', 'container',
       'capacity', 'price', 'quantity'],
      dtype='object')

### Data Types 
Review which columns are integer, float, categorical, or dates. Make sure the data type is loaded properly in the dataframe.

<font color='teal'> **Using the `df.dtypes` function, print the variable names and associated datatypes.**</font>

In [9]:
#Explaina bit about datatype and try to mark which data type we think will play a role in model
df.dtypes

date         datetime64[ns]
city                 object
lat                 float64
long                float64
pop                 float64
shop                 object
brand                object
container            object
capacity             object
price               float64
quantity            float64
dtype: object

<font color='teal'> **The `df.info()` function also prints the count of non-null values per column. Use this function to review the column names, null value counts and data types of your data frame.**</font>

In [10]:
#Check what important information we are getting from the command
df.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 7560 entries, 0.0 to nan
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       6480 non-null   datetime64[ns]
 1   city       6480 non-null   object
 2   lat        6429 non-null   float64
 3   long       6434 non-null   float64
 4   pop        6480 non-null   float64
 5   shop       6480 non-null   object
 6   brand      6480 non-null   object
 7   container  6464 non-null   object
 8   capacity   6465 non-null   object
 9   price      6480 non-null   float64
 10  quantity   6480 non-null   float64
dtypes: datetime64[ns](1), float64(5), object(5)
memory usage: 708.8+ KB

Initially we don't see any Null vlaue in the data provided

### Count of unique values or codes
<font color='teal'> **Print the count of unique values for every column, regardless of data type.**</font>

In [11]:
df.nunique

<bound method DataFrame.nunique of           date    city       lat      long       pop    shop        brand  \
id
0.0 2012-01-31  Athens  37.97945  23.71622  672130.0  shop_1  kinder-cola
1.0 2012-01-31  Athens  37.97945  23.71622  672130.0  shop_1  kinder-cola
2.0 2012-01-31  Athens  37.97945  23.71622  672130.0  shop_1  kinder-cola
3.0 2012-01-31  Athens  37.97945  23.71622  672130.0  shop_1   adult-cola
4.0 2012-01-31  Athens  37.97945  23.71622  672130.0  shop_1   adult-cola
..         ...     ...       ...       ...       ...     ...          ...
NaN        NaT     NaN       NaN       NaN       NaN     NaN          NaN
NaN        NaT     NaN       NaN       NaN       NaN     NaN          NaN
NaN        NaT     NaN       NaN       NaN       NaN     NaN          NaN
NaN        NaT     NaN       NaN       NaN       NaN     NaN          NaN
NaN        NaT     NaN       NaN       NaN       NaN     NaN          NaN

    container capacity  price  quantity
id
0.0     glass    500ml   0.96   13280.0
1.0   plastic    1.5lt   2.86    6727.0
2.0       can    330ml   0.87    9848.0
3.0     glass    500ml   1.00   20050.0
4.0       can    330ml   0.39   25696.0
..        ...      ...    ...       ...
NaN       NaN      NaN    NaN       NaN
NaN       NaN      NaN    NaN       NaN
NaN       NaN      NaN    NaN       NaN
NaN       NaN      NaN    NaN       NaN
NaN       NaN      NaN    NaN       NaN

[7560 rows x 11 columns]>

<font color='teal'> **Print the percent of unique values per column. Use the `df.nunique` and the size of the dataframe to calculate the percentages.**</font>

In [12]:
print(df.nunique()/df.shape[0])

date         0.009524
city         0.000661
lat          0.000794
long         0.000794
pop          0.003968
shop         0.000794
brand        0.000661
container    0.000397
capacity     0.000397
price        0.052116
quantity     0.802778
dtype: float64

In [13]:
df.isnull().sum()

date         1080
city         1080
lat          1131
long         1126
pop          1080
shop         1080
brand        1080
container    1096
capacity     1095
price        1080
quantity     1080
dtype: int64

Hwere we can see number of null values per attribute.

When working with categorical columns, it's really helpful to know what the unique codes are. <font color='teal'> **For example, if you look at the `brand` or `city` column, youcan print out the different states in the dataframe.**</font>

In [14]:
#The importance of reset_index
df['city'].value_counts()

Athens          2160
Larisa          1080
Irakleion       1080
Thessaloniki    1080
Patra           1080
Name: city, dtype: int64

In [15]:
#The importance of reset_index
df['brand'].value_counts()

kinder-cola     1296
adult-cola      1296
orange-power    1296
lemon-boost     1296
gazoza          1296
Name: brand, dtype: int64

### Range of values per column

<font color='teal'>**Print the range of values using the aggregate function.**</font>

Hint: you can do this in a variety of ways, but one way is using the `agg()` dataframe method. You can pass this the `[min, max]` parameter and then call `.T` on the result to transpose it.

In [16]:
df.agg([min, max]).T

                          min                  max
date      2012-01-31 00:00:00  2017-12-31 00:00:00
lat                   35.3279              40.6436
long                  21.7344              25.1434
pop                    134219               672130
price                    0.11                 4.54
quantity                 2953               145287

<font color='teal'> **Review the numeric dataset's summary statistics.**</font>

In [17]:
#To see all important information against a column in one snapshot
df.describe().T

,count,mean,std,min,25%,50%,75%,max
lat,6429.0,38.301238,1.649771,35.32787,37.96245,38.24444,39.63689,40.64361
long,6434.0,23.270246,1.086960,21.73444,22.41761,22.93086,23.71622,25.14341
pop,6480.0,355141.416667,232828.796289,134219.00000,141439.75000,257501.50000,665871.00000,672130.00000
price,6480.0,1.188981,0.814567,0.11000,0.61000,0.92000,1.50000,4.54000
quantity,6480.0,29431.855093,17901.328301,2953.00000,16441.75000,25184.00000,37866.00000,145287.00000

## Data Cleaning

### Handle the missing and NA values
Run the code below to print out the percent of each feature that is missing. You can see from the result of the code that there are 13 columns out of 27 missing data. Most of these are missing less than 10% of the data. You may need to adapt the code if your dataframe is named something other than df.


*   Consider the columns individually 
*   Identify the appropriate fill method for each column

In [18]:
#What is Missing Value and  why to impute it and when to drop it
nas=pd.DataFrame(df.isnull().sum().sort_values(ascending=False)/len(df),columns = ['percent'])
pos = nas['percent'] > 0
nas[pos]

            percent
lat        0.149603
long       0.148942
container  0.144974
capacity   0.144841
quantity   0.142857
price      0.142857
brand      0.142857
shop       0.142857
pop        0.142857
city       0.142857
date       0.142857

In [19]:
df_location = df.loc[:, ['city','long','lat']]
df.shape

(7560, 11)

In [20]:
df_location.drop_duplicates().dropna()

              city      long       lat
id
0.0         Athens  23.71622  37.97945
11.0     Irakleion  25.14341  35.32787
23.0         Patra  21.73444  38.24444
36.0  Thessaloniki  22.93086  40.64361
46.0        Athens  23.68708  37.96245
57.0        Larisa  22.41761  39.63689

Here is the list of cities along with thier latitude and longitude information

In [21]:
dfna = df[df['city'].isnull() == False]
dfna.shape

(6480, 11)

 As we know latitude and longitude refers to a location of any city so we can safely remove columns `lat` and `long`.

<font color='teal'> **In the cell below, remove columns 'lat' and 'long'.**</font>

In [22]:
dfna = dfna.drop(['lat','long'], axis = 1)

In [23]:
dfna.head()

,date,city,pop,shop,brand,container,capacity,price,quantity
id,,,,,,,,,
0.0,2012-01-31,Athens,672130.0,shop_1,kinder-cola,glass,500ml,0.96,13280.0
1.0,2012-01-31,Athens,672130.0,shop_1,kinder-cola,plastic,1.5lt,2.86,6727.0
2.0,2012-01-31,Athens,672130.0,shop_1,kinder-cola,can,330ml,0.87,9848.0
3.0,2012-01-31,Athens,672130.0,shop_1,adult-cola,glass,500ml,1.00,20050.0
4.0,2012-01-31,Athens,672130.0,shop_1,adult-cola,can,330ml,0.39,25696.0

In [24]:
dfna.info()

<class 'pandas.core.frame.DataFrame'>
Float64Index: 6480 entries, 0.0 to 6479.0
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   date       6480 non-null   datetime64[ns]
 1   city       6480 non-null   object
 2   pop        6480 non-null   float64
 3   shop       6480 non-null   object
 4   brand      6480 non-null   object
 5   container  6464 non-null   object
 6   capacity   6465 non-null   object
 7   price      6480 non-null   float64
 8   quantity   6480 non-null   float64
dtypes: datetime64[ns](1), float64(3), object(5)
memory usage: 506.2+ KB

Columns still having Null values are - Container , capacity

<font color='teal'> **Extract records having Null values for container.**</font>

In [25]:
dfna[dfna['capacity'].isnull()]

,date,city,pop,shop,brand,container,capacity,price,quantity
id,,,,,,,,,
1553.0,2013-06-30,Patra,166301.0,shop_6,kinder-cola,glass,NaN,1.46,25634.0
1847.0,2013-09-30,Thessaloniki,347001.0,shop_4,gazoza,plastic,NaN,0.93,42320.0
2584.0,2014-05-31,Athens,668203.0,shop_3,lemon-boost,glass,NaN,0.61,27136.0
3040.0,2014-10-31,Larisa,140563.0,shop_5,adult-cola,can,NaN,0.69,21225.0
3246.0,2015-01-31,Athens,667237.0,shop_1,gazoza,glass,NaN,0.51,46809.0
3624.0,2015-05-31,Patra,167001.0,shop_6,adult-cola,glass,NaN,1.06,49039.0
4450.0,2016-02-29,Thessaloniki,351702.0,shop_4,orange-power,glass,NaN,0.70,34008.0
4776.0,2016-06-30,Athens,665102.0,shop_1,orange-power,plastic,NaN,1.88,26675.0
4812.0,2016-06-30,Thessaloniki,351702.0,shop_4,gazoza,glass,NaN,0.77,40645.0
4868.0,2016-07-31,Athens,665102.0,shop_1,orange-power,can,NaN,0.60,41847.0
5142.0,2016-10-31,Irakleion,137302.0,shop_2,kinder-cola,glass,NaN,1.20,16534.0
5221.0,2016-11-30,Athens,665102.0,shop_1,kinder-cola,plastic,NaN,3.08,8877.0
5585.0,2017-03-31,Athens,665871.0,shop_1,adult-cola,can,NaN,0.46,32284.0
5890.0,2017-06-30,Thessaloniki,353001.0,shop_4,lemon-boost,glass,NaN,0.93,37348.0
6402.0,2017-12-31,Athens,665871.0,shop_1,lemon-boost,can,NaN,0.42,31800.0

In [26]:
#extract information regarding container for different brand and respective capacity
df_c2c = dfna[['brand','container','capacity']].drop_duplicates().dropna()
df_c2c.sort_values('capacity')

             brand container capacity
id
1.0    kinder-cola   plastic    1.5lt
9.0    lemon-boost   plastic    1.5lt
18.0        gazoza   plastic    1.5lt
27.0    adult-cola   plastic    1.5lt
29.0  orange-power   plastic    1.5lt
2.0    kinder-cola       can    330ml
4.0     adult-cola       can    330ml
6.0   orange-power       can    330ml
10.0   lemon-boost       can    330ml
19.0        gazoza       can    330ml
0.0    kinder-cola     glass    500ml
3.0     adult-cola     glass    500ml
5.0   orange-power     glass    500ml
7.0         gazoza     glass    500ml
8.0    lemon-boost     glass    500ml

Now we get an idea about the container material w.r.t to the capacity.
* 1.5ts --> Plastic,
* 500 ml --> glass, 
* 330 ml --> can



Fill Null values for container column according to the given format.

In [27]:
dfna['capacity'] = dfna['container'].apply(lambda x : "1.5lt" if x == 'plastic' else ('330ml' if x == "can" else '500ml'))

In [28]:
dfna['container'] = dfna['capacity'].apply(lambda x : "plastic" if x == '1.5lt' else ('can' if x == "330ml" else 'glass'))

CHECK IF ANY NULL VALUE STILL EXIST IN THE DATASET

In [29]:
dfna.isnull().sum()

date         0
city         0
pop          0
shop         0
brand        0
container    0
capacity     0
price        0
quantity     0
dtype: int64

### Look for duplicate rows
Run the code below to print out the duplicated rows.You can see there are no duplicate rows, so in this particular case there is nothing else to do related to duplicate rows. You will review duplicate or synonymous columns in Step 3 of the Guided Capstone.

In [31]:
duplicateRowsDF = dfna[dfna.duplicated()]
duplicateRowsDF

Empty DataFrame
Columns: [date, city, pop, shop, brand, container, capacity, price, quantity]
Index: []

## Export data to a new csv file 
In order to bring the changes you made here into the next notebook, you need to write out the updated data frame to a new csv file.

<font color='teal'> **Export the processed dataframe as a csv file to the data folder you created earlier. Name this new csv file `house_data_output_step1.csv`.**</font>

Hint: you can use the `to_csv()` dataframe method here.

In [30]:
dfna.to_csv('house_data_output_step1.csv')

The data transformations created in this step of the DSM are all generally steps to be applied to any data science project. However, the decisions we made about how to handle the missing and NA data are specific to the problem at hand. In the next step of the DSM and the next Guided Capstone Notebook, you'll see how all these steps prepare the data for exploratory data analysis.